---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AllModelTypeImage
source: html/29657528-1b44-13c2-5c18-0577289b3e86.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AllModelTypeImage Property

"Type Image"

## Syntax (C#)
```csharp
public static ForgeTypeId AllModelTypeImage { get; }
```